<a href="https://datamics.com/de/courses/"><img src=../../DATA/bg_datamics_top.png></a>

<em text-align:center>© Datamics</em>
# Operations

Es gibt einige weitere nützliche Operationen, die aber nicht in eine bestimmte Kategorie fallen. Diesen ist diese Lektion gewidmet.

In [1]:
import pandas as pd
df = pd.DataFrame({'spa1':[1,2,3,4],'spa2':[444,555,666,444],'spa3':['abc','def','ghi','xyz']})
df.head()

   spa1  spa2 spa3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

## Information über Unique Values (dt. einzigartige Werte)

In [2]:
df['spa2'].unique()

array([444, 555, 666], dtype=int64)

In [3]:
df['spa2'].nunique()

3

In [4]:
df['spa2'].value_counts()

444    2
555    1
666    1
Name: spa2, dtype: int64

## Daten wählen

In [5]:
# Vom Data Frame durch Bedingungen von mehreren Spalten auswählen
newdf = df[(df['spa1']>2) & (df['spa2']==444)]

In [6]:
newdf

   spa1  spa2 spa3
3     4   444  xyz

## Funktionen anwenden

In [7]:
def mal2(x):
    return x*2

In [8]:
df['spa1'].apply(mal2)

0    2
1    4
2    6
3    8
Name: spa1, dtype: int64

In [9]:
df['spa3'].apply(len)

0    3
1    3
2    3
3    3
Name: spa3, dtype: int64

In [10]:
df['spa1'].sum()

10

## Spalten dauerhaft entfernen

In [11]:
del df["spa1"]

In [12]:
df

   spa2 spa3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

## Spalten und Index Namen erhalten

In [13]:
df.columns

Index(['spa2', 'spa3'], dtype='object')

In [14]:
df.index

RangeIndex(start=0, stop=4, step=1)

## Einen Data Frame sortieren und ordnen

In [15]:
df

   spa2 spa3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [16]:
df.sort_values(by='spa2') #inplace=False per Standard

   spa2 spa3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

## Nullwerte finden bzw. darauf prüfen

In [17]:
df.isnull()

    spa2   spa3
0  False  False
1  False  False
2  False  False
3  False  False

In [18]:
# Zeilen mit NaN Werten fallen lassen
df.dropna()

   spa2 spa3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

### Nullwerte mit etwas Anderem füllen

In [19]:
import numpy as np

In [20]:
df = pd.DataFrame({'spa1':[1,2,3,np.nan],
                   'spa2':[np.nan,555,666,444],
                   'spa3':['abc','def','ghi','xyz']})
df.head()

   spa1   spa2 spa3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [21]:
df.fillna('FILL')

   spa1  spa2 spa3
0     1  FILL  abc
1     2   555  def
2     3   666  ghi
3  FILL   444  xyz

# Pivotieren

In [22]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [23]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [24]:
df.pivot_table(values='D',index=['A', 'B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# Gut gemacht!